**Terraform Format and Style🖌** `success`
**Terraform Initialization ⚙️** `success`
**Terraform Plan 📖** `success`
**Terraform Validation 🤖** `success`

<details><summary>Show Plan</summary>

```hcl
data.tls_certificate.github: Reading...
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161946]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.bimi: Refreshing state... [id=32326126]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161949]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161945]
module.aws_fastmail_witteman_me.data.dns_a_record_set.mail: Reading...
module.aws_fastmail_georgewitteman_com.data.dns_a_record_set.mail: Reading...
module.aws_fastmail_wtmn_net.data.dns_a_record_set.mail: Reading...
module.aws_fastmail_georgewitteman_me.data.dns_a_record_set.mail: Reading...
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[0]: Refreshing state... [id=37701474]
module.aws_fastmail_wtmn_net.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_georgewitteman_com.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_witteman_me.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_georgewitteman_me.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[2]: Refreshing state... [id=37701473]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[1]: Refreshing state... [id=37701460]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[3]: Refreshing state... [id=37701475]
dnsimple_zone_record.github_redirect: Refreshing state... [id=26395267]
data.tls_certificate.github: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=29377246]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701468]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.www_cname: Refreshing state... [id=28036169]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26880813]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161934]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161953]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161954]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161955]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701466]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161937]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161943]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.spf: Refreshing state... [id=37701457]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26880821]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_submission: Refreshing state... [id=26880815]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26880820]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mail: Refreshing state... [id=26161935]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26880818]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701458]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26880825]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161962]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.bimi: Refreshing state... [id=32326125]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701459]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701465]
dnsimple_zone_record.files_wtmn_net_alias: Refreshing state... [id=27004600]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_imaps: Refreshing state... [id=29377249]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_submission: Refreshing state... [id=29377242]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701467]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=29377239]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=29377238]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.bimi: Refreshing state... [id=32326124]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mail: Refreshing state... [id=29377236]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.spf: Refreshing state... [id=37701456]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701476]
dnsimple_zone_record.google_workspace_verification: Refreshing state... [id=37701471]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.spf: Refreshing state... [id=37701469]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26880814]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26880823]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26880824]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[1]: Refreshing state... [id=29377245]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[0]: Refreshing state... [id=29377241]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[2]: Refreshing state... [id=29377244]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161942]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701461]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.spf: Refreshing state... [id=37701470]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161936]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mail: Refreshing state... [id=26161951]
module.dnsimple_github_pages.dnsimple_zone_record.cname-record-www: Refreshing state... [id=26161971]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161939]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_jmap: Refreshing state... [id=29377237]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161958]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.verify_cname: Refreshing state... [id=28036170]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161972]
module.dnsimple_short_io.dnsimple_zone_record.a_record_2: Refreshing state... [id=37701472]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161947]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26880816]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.bimi: Refreshing state... [id=32326123]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=29377247]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161944]
module.dnsimple_github_pages.dnsimple_zone_record.alias-record-root: Refreshing state... [id=37701462]
module.dnsimple_short_io.dnsimple_zone_record.a_record_1: Refreshing state... [id=37701464]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mail: Refreshing state... [id=26880812]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161931]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161932]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161933]
data.github_user.georgewitteman: Reading...
data.github_repository.terraform: Reading...
data.github_repository.terraform: Read complete after 0s [id=terraform]
data.github_user.georgewitteman: Read complete after 0s [id=5918935]
aws_route53_zone.georgewitteman_me: Refreshing state... [id=Z0431101102WXYNRXVF0T]
aws_route53_zone.marcywitteman_com: Refreshing state... [id=Z0939016Z0WL8RV5A0D1]
aws_route53_zone.georgewitteman_com: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN]
aws_route53_zone.wtmn_net: Refreshing state... [id=Z093069418CSBZIY3FKFL]
aws_s3_bucket.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_key_pair.georgewitteman: Refreshing state... [id=georgewitteman-personal]
aws_s3_bucket.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_kms_key.primary_kms_key: Refreshing state... [id=d5eef806-22ba-4f53-a96f-3d3e6e545e07]
aws_route53_zone.witteman_me: Refreshing state... [id=Z05063061CYA524JAU8BC]
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::866631827662:oidc-provider/token.actions.githubusercontent.com]
aws_vpc.this: Refreshing state... [id=vpc-0531d36726bdd6529]
aws_kms_key.dynamo_db_kms: Refreshing state... [id=1a1ca031-daf5-4f17-aa7d-2d2d2ca5a865]
aws_eip.nat[1]: Refreshing state... [id=eipalloc-0eab7a9978907b615]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f95edc7d600a0f11]
data.aws_iam_policy_document.github_oidc: Reading...
data.aws_iam_policy_document.github_oidc: Read complete after 0s [id=1151702415]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-locks]
aws_iam_role.github_oidc: Refreshing state... [id=GitHubActionsOIDC]
aws_route53_record.witteman_me_txt: Refreshing state... [id=Z05063061CYA524JAU8BC__TXT]
aws_route53_record.wtmn_net_txt: Refreshing state... [id=Z093069418CSBZIY3FKFL__TXT]
module.acm_witteman_test_com.data.aws_route53_zone.this: Reading...
module.aws_fastmail_witteman_me.aws_route53_record.mail: Refreshing state... [id=Z05063061CYA524JAU8BC_mail_A]
module.aws_fastmail_witteman_me.aws_route53_record.srv_imaps: Refreshing state... [id=Z05063061CYA524JAU8BC__imaps._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_carddavs: Refreshing state... [id=Z05063061CYA524JAU8BC__carddavs._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_pop3: Refreshing state... [id=Z05063061CYA524JAU8BC__pop3._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.dmarc[0]: Refreshing state... [id=Z05063061CYA524JAU8BC__dmarc_TXT]
module.aws_fastmail_witteman_me.aws_route53_record.srv_caldav: Refreshing state... [id=Z05063061CYA524JAU8BC__caldav._tcp_SRV]
module.aws_fastmail_witteman_me.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_witteman_me.aws_route53_record.srv_caldavs: Refreshing state... [id=Z05063061CYA524JAU8BC__caldavs._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.mx: Refreshing state... [id=Z05063061CYA524JAU8BC__MX]
module.aws_fastmail_witteman_me.aws_route53_record.srv_jmap: Refreshing state... [id=Z05063061CYA524JAU8BC__jmap._tcp_SRV]
module.acm_witteman_test_com.data.aws_route53_zone.this: Read complete after 0s [id=Z05063061CYA524JAU8BC]
module.aws_fastmail_witteman_me.aws_route53_record.srv_carddav: Refreshing state... [id=Z05063061CYA524JAU8BC__carddav._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_pop3s: Refreshing state... [id=Z05063061CYA524JAU8BC__pop3s._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_submission: Refreshing state... [id=Z05063061CYA524JAU8BC__submission._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_imap: Refreshing state... [id=Z05063061CYA524JAU8BC__imap._tcp_SRV]
aws_route53_record.georgewitteman_me_txt: Refreshing state... [id=Z0431101102WXYNRXVF0T__TXT]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_pop3s: Refreshing state... [id=Z093069418CSBZIY3FKFL__pop3s._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.mail: Refreshing state... [id=Z093069418CSBZIY3FKFL_mail_A]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_submission: Refreshing state... [id=Z093069418CSBZIY3FKFL__submission._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_imap: Refreshing state... [id=Z093069418CSBZIY3FKFL__imap._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_carddavs: Refreshing state... [id=Z093069418CSBZIY3FKFL__carddavs._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_caldav: Refreshing state... [id=Z093069418CSBZIY3FKFL__caldav._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_pop3: Refreshing state... [id=Z093069418CSBZIY3FKFL__pop3._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_imaps: Refreshing state... [id=Z093069418CSBZIY3FKFL__imaps._tcp_SRV]
module.aws_fastmail_witteman_me.data.aws_route53_zone.selected: Read complete after 1s [id=Z05063061CYA524JAU8BC]
module.aws_fastmail_wtmn_net.aws_route53_record.mx: Refreshing state... [id=Z093069418CSBZIY3FKFL__MX]
module.aws_fastmail_wtmn_net.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_wtmn_net.aws_route53_record.dmarc[0]: Refreshing state... [id=Z093069418CSBZIY3FKFL__dmarc_TXT]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_carddav: Refreshing state... [id=Z093069418CSBZIY3FKFL__carddav._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_caldavs: Refreshing state... [id=Z093069418CSBZIY3FKFL__caldavs._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_jmap: Refreshing state... [id=Z093069418CSBZIY3FKFL__jmap._tcp_SRV]
aws_route53_record.georgewitteman_com_txt: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__TXT]
aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_server_side_encryption_configuration.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_versioning.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_subnet.public[1]: Refreshing state... [id=subnet-00ae48e4b817339e0]
aws_internet_gateway.this: Refreshing state... [id=igw-03e5d4bd084f0bab7]
aws_subnet.public[0]: Refreshing state... [id=subnet-00d39134e9b5fa53b]
aws_route_table.public: Refreshing state... [id=rtb-0d091192150dea7f5]
aws_subnet.private[0]: Refreshing state... [id=subnet-051e9de45c87a959d]
aws_s3_bucket_server_side_encryption_configuration.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_subnet.private[1]: Refreshing state... [id=subnet-083e37d65579ec479]
aws_s3_bucket_public_access_block.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_versioning.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_logging.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
module.aws_fastmail_wtmn_net.data.aws_route53_zone.selected: Read complete after 0s [id=Z093069418CSBZIY3FKFL]
aws_s3_bucket_acl.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs,log-delivery-write]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_pop3: Refreshing state... [id=Z0431101102WXYNRXVF0T__pop3._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.mail: Refreshing state... [id=Z0431101102WXYNRXVF0T_mail_A]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_submission: Refreshing state... [id=Z0431101102WXYNRXVF0T__submission._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.mx: Refreshing state... [id=Z0431101102WXYNRXVF0T__MX]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_pop3s: Refreshing state... [id=Z0431101102WXYNRXVF0T__pop3s._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_caldav: Refreshing state... [id=Z0431101102WXYNRXVF0T__caldav._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_carddav: Refreshing state... [id=Z0431101102WXYNRXVF0T__carddav._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_caldavs: Refreshing state... [id=Z0431101102WXYNRXVF0T__caldavs._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_imaps: Refreshing state... [id=Z0431101102WXYNRXVF0T__imaps._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_carddavs: Refreshing state... [id=Z0431101102WXYNRXVF0T__carddavs._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dmarc[0]: Refreshing state... [id=Z0431101102WXYNRXVF0T__dmarc_TXT]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_imap: Refreshing state... [id=Z0431101102WXYNRXVF0T__imap._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_jmap: Refreshing state... [id=Z0431101102WXYNRXVF0T__jmap._tcp_SRV]
module.aws_fastmail_georgewitteman_me.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm1._domainkey_CNAME]
module.aws_fastmail_georgewitteman_me.data.aws_route53_zone.selected: Read complete after 0s [id=Z0431101102WXYNRXVF0T]
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm2._domainkey_CNAME]
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm3._domainkey_CNAME]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_carddavs: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__carddavs._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_imap: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__imap._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_caldavs: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__caldavs._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.mx: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__MX]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_imaps: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__imaps._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.mail: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_mail_A]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dmarc[0]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__dmarc_TXT]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_submission: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__submission._tcp_SRV]
module.aws_fastmail_georgewitteman_com.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_caldav: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__caldav._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_carddav: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__carddav._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_pop3: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__pop3._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_jmap: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__jmap._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_pop3s: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__pop3s._tcp_SRV]
module.aws_squarespace_marcywitteman_com.aws_route53_record.www_cname: Refreshing state... [id=Z0939016Z0WL8RV5A0D1_www_CNAME]
module.aws_squarespace_marcywitteman_com.aws_route53_record.verify_cname: Refreshing state... [id=Z0939016Z0WL8RV5A0D1_ygcg8lysbebsftxsez6l_CNAME]
module.aws_squarespace_marcywitteman_com.aws_route53_record.a: Refreshing state... [id=Z0939016Z0WL8RV5A0D1__A]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm1._domainkey_CNAME]
module.aws_fastmail_georgewitteman_com.data.aws_route53_zone.selected: Read complete after 5s [id=Z04997513SHTSY0FZ1ZPN]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm2._domainkey_CNAME]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm3._domainkey_CNAME]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-050a400e2080b4c11]
aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-0d091192150dea7f51080289494]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00f61e31cf053bde0]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-02ad6f5e0e62d6084]
aws_nat_gateway.this[1]: Refreshing state... [id=nat-0b3ba6295ff432385]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm3._domainkey_CNAME]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm1._domainkey_CNAME]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm2._domainkey_CNAME]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm2._domainkey_CNAME]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm3._domainkey_CNAME]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm1._domainkey_CNAME]
aws_route_table.private[0]: Refreshing state... [id=rtb-09d9f2dcbbb27c73c]
aws_route_table.private[1]: Refreshing state... [id=rtb-0421fc362d0be267c]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-086178e831a055e81]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-069aefed8b305b68b]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09d9f2dcbbb27c73c1080289494]
aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0421fc362d0be267c1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_zone.witteman_test_com will be created
  + resource "aws_route53_zone" "witteman_test_com" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "witteman-test.com"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + zone_id       = (known after apply)
    }

  # aws_route53domains_registered_domain.witteman_test_com will be created
  + resource "aws_route53domains_registered_domain" "witteman_test_com" {
      + abuse_contact_email = (known after apply)
      + abuse_contact_phone = (known after apply)
      + admin_privacy       = true
      + auto_renew          = true
      + creation_date       = (known after apply)
      + domain_name         = "witteman-test.com"
      + expiration_date     = (known after apply)
      + id                  = (known after apply)
      + registrant_privacy  = true
      + registrar_name      = (known after apply)
      + registrar_url       = (known after apply)
      + reseller            = (known after apply)
      + status_list         = (known after apply)
      + tags_all            = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + tech_privacy        = true
      + transfer_lock       = true
      + updated_date        = (known after apply)
      + whois_server        = (known after apply)

      + admin_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }

      + name_server {
          + glue_ips = (known after apply)
          + name     = (known after apply)
        }

      + registrant_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }

      + tech_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }
    }

  # module.acm_witteman_test_com.aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "witteman.me"
      + domain_validation_options = [
          + {
              + domain_name           = "witteman.me"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "witteman.me",
        ]
      + tags_all                  = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.acm_witteman_test_com.aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.acm_witteman_test_com.aws_route53_record.this["witteman.me"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05063061CYA524JAU8BC"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @georgewitteman, Action: `pull_request`*